#pragma once

#include <d3d11.h>
#include <DirectXMath.h>
#include"direct3d.h"
#include"sprite.h"
#include"shader.h"
using namespace DirectX;
#include"field.h"
#include"player3D.h"
//=========================================================================================================
// マクロ定義
//=========================================================================================================
#define COE (0.1f)//反発係数

//=========================================================================================================
// 構造体宣言
//=========================================================================================================
enum COLLISION_HIT
{
	HIT_NONE,
	HIT_GROUND,
	HIT_WALL_NegZ,		//-Z
	HIT_WALL_PlusX,		//+x
	HIT_WALL_PlusZ,		//+Z
	HIT_WALL_NegX,		//-X

	HIT_MAX,
};
//=========================================================================================================
// プロトタイプ宣言
//=========================================================================================================
<<<<<<< HEAD
float Player3DField_Collision();

void Collision_DebugDraw();
=======
int Player3DField_Collision();
>>>>>>> 73db079adbbd2c5bc2d828804b3c84a05ea683c0
