//manager.h
#pragma once

//=========================================================================================================
// 構造体
//=========================================================================================================
enum SCENE
{
	SCENE_NONE = 0,		//何もなし
	SCENE_TITLE,		//タイトルシーン
	SCENE_GAME,			//ゲームシーン
	SCENE_RESULT,		//リザルトルシーン

};

//=========================================================================================================
// プロトタイプ宣言
//=========================================================================================================
void	Manager_Initialize();
void	Manager_Finalize();
void	Manager_Update();
void	Manager_Draw();
void	SetScene(SCENE scene);
int		GetScene(void);

